package ind.kephan.textreader

val sample = "《卡徒》来自: https://m.txt99.cc/txt/1777.html\n" +
        "\n" +
        "===第一节 以卡为生===\n" +
        "\n" +
        "刀片一般的笔尖轻轻地在一张青灰色的卡片上滑过。蓝色的纤细线条流畅地从笔尖下延伸。巴掌大的卡片上面淡蓝色的线条不断增多，渐渐，一个繁复玄奥的图案随着笔尖的滑动而不断变得更加完美。\n" +
        "\n" +
        "    陈暮的眼神专注地盯着这张卡片，呼吸轻缓，仿佛生怕惊动了什么。仔细看的话就可以发现，他右手手臂自始至终都完全没有挪动分毫，动的只有他的手腕。他的右腕灵活得就像蛇一般，柔若无骨。笔尖轻轻一转，一个优雅的弧线出现在卡片上。突然笔尖重重一顿，一改刚才的轻灵，紧接着猛地一个锋侧钩，笔钩如刀锋卡片上的图案骤然一亮，随即迅速黯淡下去，恢复如常。\n" +
        "\n" +
        "    陈暮随手把它放到桌上一旁堆放的一堆卡片之中。他的动作娴熟自然，看不出有丝毫滞碍之处。完成这张卡片他的脸上依然专注如故，他现在才完成十五张，离今天的任务还有十张的差额。他现在正在制作的是一星级的能量卡，作为最低级的能量卡，它是目前使用范围最广，也是消耗量最大的卡片之一。正在这时，房间突然一片黑暗。\n" +
        "\n" +
        "    “该死，能量又用完了”陈暮嘟囔几句，左手随手从卡片堆里抽出一张能量卡，随即在右腕上轻轻一按，右手腕佩带的度仪射出一束明亮的光束。在光束的帮助下，陈暮小心翼翼走到墙角，房间里实在太杂乱，他可不想碰翻什么东西。房间角落的墙壁上有一处方形仪表，仪表下有一处插槽，陈暮把手上的能量卡插入仪表的插槽中。\n" +
        "\n" +
        "    能量卡刚一插入卡槽，房间便恢复光明。仪表上显示出数字一百。没想到能量就用完了，看来今天的任务又要多加一张了。回到桌前的陈暮迅速投入到工作之中，他的所有生活来源都依靠这种最纸级的卡片。从三年前他学会了制作这种能量卡之后，每天二十五张的工作量他从未有一天中断过。\n" +
        "\n" +
        "    陈暮的房间很小，只有不到四十平米，里面摆放着一张半旧工作桌。除了工作桌上还比较干净以外，房间其他地方到处堆放着堆积如山的杂物。这些杂物也是五花八门，成堆的旧书，散放的各种原料。\n" +
        "\n" +
        "    在这个简陋的地方，陈暮整整住了三年。这里是联邦政府专门提供的救济房，像这样的一个小房间，每个月只需要交纳一百五十欧迪便可以入住。对于像陈暮这样的穷人来说，实在没有比这里更便宜的地方了。更何况在他看来，自己这样已经算得比较不错了，他甚至见过全家四口挤在同样大小的房间里。\n" +
        "\n" +
        "    下午五点，陈暮终于完成了今天一天的工作二十五张能量卡。仔细地数了数卡片的数量，连着数了两遍，确定数目没有错误他才小心地把能量卡装入衣服里的卡包之中。\n" +
        "\n" +
        "    走上街道，夜色已经渐渐浓重起来。斑斓的灯光在夜色中令人流连，天空上不时飞过的梭车尾部喷出的焰火拖曳出一道又一道一晃而逝的艳丽轨迹。陈暮略略收紧外衣，仰脸看了看天。寒气渐重，看来冬天快来了吧。没有多余的心思去感慨时间流逝，只是冬天取暖又要多一笔消耗了，陈暮在心中盘算着。\n" +
        "\n" +
        "    从东卫学府的后门前经过，这条路陈暮已经走过三年，但是每次看到那些结伴进进出出的学员，他的心里还是忍不住会升起一种莫名的情绪。整了整心绪，陈暮朝学府旁的一间小店快步走去。小店名叫“东卫杂货店”在东卫学府周围，同样名字的类似小店，起码有不下二十家。这家小店三年里，陈暮每天都会光顾，风雨无阻，从未间断过。只不过他到这里并不是买东西，相反，他是来卖东西的。\n" +
        "\n" +
        "    他一进门，店主便注意到，招呼着：“阿暮来了啊”\n" +
        "\n" +
        "    “嗯，华叔。”他朝店主回答了一声。店主华叔是一位五十岁左右的老人，岁月在他身上留下了无法掩饰的痕迹。细密的皱纹，半白的花发，架着一副老花镜。\n" +
        "\n" +
        "    “这是今天的货。”陈暮小心地从怀里取出卡包，抽出那一叠能量卡，递到店主面前：“二十五张。”\n" +
        "\n" +
        "    华叔接过陈暮手上的卡片，看也没看随手放到货架上，笑着说：“幸亏有阿暮你天天送卡来，要不我这里货源都要短缺了。”\n" +
        "\n" +
        "    陈暮微微一笑，却没有接腔，他知道华叔这话大抵是玩笑的意味。一星能量卡是最廉价的能量卡，但也是消耗量最大的卡片之一，更何况这里位于东卫学府附近，一天哪里可能只卖二十五张能量卡\n" +
        "\n" +
        "    华叔也知道陈暮的脾气，也不废话，直接问：“阿暮是需要现金还是转账”“转账。”陈暮干脆地回答，说完便把早已经准备好的一张淡绿色迪卡递到华叔面前。结算完的陈暮朝华叔道别之后便欲转身离开。\n" +
        "\n" +
        "    华叔突然叫住陈暮：“阿暮等一下。”"

val strList = sample.split("\n")